<!DOCTYPE html>
<html>
<head>
<meta charset="iso-8859-1">
<link rel="stylesheet" type="text/css" href="styleTP.css">
<title>TP 1 - LW</title>

</head>

<body>

	<div id="page">

		<h1>TP 1 : HTML - Mise en forme et mise en page simple</h1>

		<p>Ce premier TP a pour objectif de vous familiariser avec les
			bases du langage HTML et les bases de la mise en page avec les CSS.
		<h3>Pr&eacute;-requis</h3>
		Ce TP couvre les parties suivantes du cours HTML :
		<ul>
			<li>Pr&eacute;sentation de HTML</li>
			<li>Les feuilles de styles</li>
			<li>CSS utilisation avanc&eacute;e</li>
			<li>Vid&eacute;os HTML chapitre 1 - Principes de base</li>
			<li>Vid&eacute;os HTML - Les feuilles de styles</li>
		</ul>
		<h3>Travail &agrave; r&eacute;aliser</h3>
		<p>
			L'objectif est de r&eacute;aliser 2 pages de l'application Cuiteur :
			une <a href="images/page_presentation_4.jpg" target="pres4">page
				de pr&eacute;sentation</a> et une <a target="pres5"
				href="images/page_moyens.jpg">page d'illustrations</a>.
		</p>
		<p>
			Il faut proc&eacute;der par &eacute;tapes (ou it&eacute;rations) pour
			la conception de la page finale
			<code>
				<a href="images/page_presentation_4.jpg" target="pres4">presentation.html</a>
			</code>
			. Placez chaque &eacute;tape dans un fichier s&eacute;par&eacute;
			pour bien voir chaque phase de construction et pouvoir revenir
			facilement en arri&egrave;re quand vous vous &ecirc;tes
			emm&ecirc;l&eacute;s les doigts dans le clavier.
		</p>
		<p>
			Vous <strong><span class="red">DEVEZ</span></strong> reproduire
			&agrave; l'identique les 5 pages suivantes qui consistuent des
			&eacute;tapes de construction.
		</p>
		<p class="important">
			Remarque importante : vous n'&ecirc;tes pas en train de faire une
			course de vitesse, mais la conception de pages qui doivent avoir un
			code clair et une mise en forme / page facilement identifiable et
			modifiable. <strong>Le but n'est pas la rapidit&eacute; mais
				la qualit&eacute;</strong>.
		</p>
		<h4>Etape 1</h4>
		<p>
			<a target="pres1" href="images/page_presentation_1.jpg"><img
				src="images/page_presentation_1_mini.jpg" alt="" width="250"
				height="358" border="1" align="left" class="flotteGauche"></a><strong>R&eacute;aliser
				la page <a href="images/page_presentation_1.jpg" target="pres1"><code>presentation_1.html</code></a>
				avec la structuration de son contenu textuel.
			</strong>
		</p>
		<p>
			Commencez par une page HTML simple, contenant uniquement les textes (<a
				href="textes.txt" target="_blank">&agrave;
				t&eacute;l&eacute;charger ici</a>) structur&eacute;s par des tags HTML
			ayant la bonne signification s&eacute;mantique. A cette &eacute;tape
			l'utilisation de tags div est <strong>interdite</strong>. Vous n'avez
			pas le droit d'utiliser plus de 2 tags div pour r&eacute;aliser la
			page compl&egrave;te.
		</p>
		<p>Cette page n'a pas de feuille de styles.</p>
		<p>Placez les liens sur les &eacute;l&eacute;ments qui en ont et
			testez les, m&ecirc;me si certains pointeront sur des pages qui ne
			sont pas encore r&eacute;alis&eacute;es.</p>
		<p>R&eacute;gle &agrave; utiliser : KISS (Keep It Simple Stupid)</p>
		<h4>
			<a href="images/page_presentation_2.jpg" target="pres2"><code>
				</code></a>Etape 2
		</h4>
		<p>
			<a target="pres2" href="images/page_presentation_2.jpg"><img
				src="images/page_presentation_2_mini.jpg" alt="" width="250"
				height="562" border="1" class="flotteGauche"></a><strong>R&eacute;aliser
				la page <a href="images/page_presentation_2.jpg" target="pres2"><code>presentation_2.html</code></a>
				avec les images ajout&eacute;es aux textes de l'&eacute;tape
				pr&eacute;c&eacute;dente.
			</strong>
		</p>
		<p>
			Ins&eacute;rez les images (<a href="images.zip">&agrave;
				t&eacute;l&eacute;charger ici</a>.) dans la page
			pr&eacute;c&eacute;dente. Ne vous occupez pas pour l'instant du
			placement sp&eacute;cifique des images
		</p>
		<p>Placez les liens sur les &eacute;l&eacute;ments qui en ont et
			testez les, m&ecirc;me si certains pointeront sur des pages qui ne
			sont pas encore r&eacute;alis&eacute;es.</p>

		<h4>Etape 3</h4>
		<p>
			<a target="pres3" href="images/page_presentation_3.jpg"><img
				src="images/page_presentation_3_mini.jpg" alt="" width="250"
				height="623" border="1" class="flotteGauche"></a> <strong>R&eacute;aliser
				la page <a href="images/page_presentation_3.jpg" target="pres3"><code>presentation_3.html</code></a>
				avec une feuille de styles pour la mise en forme des textes.
			</strong>
		</p>
		<p>
			Ajoutez une feuille de styles (
			<code>presentation.css</code>
			). Dans un premier temps il faut d&eacute;finir la mise en forme :
			les styles des textes, titres, parapgraphes, gras, liens, etc.
		</p>
		<p>
			Commencez par r&eacute;-initialiser la feuille de style par
			d&eacute;faut du navigateur selon la m&eacute;thode propos&eacute;e
			par : <a target="_blank"
				href="http://meyerweb.com/eric/tools/css/reset/">http://meyerweb.com/eric/tools/css/reset/</a>.
		</p>
		<p>D&eacute;finissez le bloc de contenu de la page avec un tag div
			et stylez le avec une image de fond et une dimension (rappel : vous
			n'avez pas le droit d'utiliser plus de 2 tags div pour
			r&eacute;aliser la page compl&egrave;te).</p>
		<p>Stylez les tags HTML n&eacute;cessaires et d&eacute;finissez
			des classes pour faire de la mise en forme. Il ne faut pas essayer de
			vouloir tout faire &agrave; la fois. En commen&ccedil;ant par la mise
			en forme vous simplifierez beaucoup la phase suivante qui est la mise
			en page.</p>
		<p>Faites autant d'it&eacute;rations que vous voulez pour terminer
			la mise en forme. Conseil : quand vous avez termin&eacute; une partie
			significative sauvegardez votre feuille de styles pour un retour en
			arri&egrave;re facile. Normalement, &agrave; ce stage vous ne devriez
			plus modifier le code HTML, mais uniquement le code CSS.</p>
		<p>R&eacute;gle &agrave; utiliser : KISS (Keep It Simple Stupid)</p>

		<h4>Etape 4</h4>
		<p>
			<a target="pres4" href="images/page_presentation_4.jpg"><img
				src="images/page_presentation_4_mini.jpg" alt="" width="250"
				height="623" border="1" class="flotteGauche"></a><strong>R&eacute;aliser
				la page <code>
					<a href="images/page_presentation_4.jpg" target="pres4">presentation.html</a>
				</code> termin&eacute;e avec la feuille de styles compl&egrave;t&eacute;e
				par la mise en page.
			</strong>
		</p>
		<p>Vous &ecirc;tes maintenant dans la derni&egrave;re partie du
			travail : la mise en page. C'est la plus difficile car il faut
			utiliser les propri&eacute;t&eacute;s de style de positionnement.
			Certains &eacute;l&eacute;ments seront positionn&eacute;s avec des
			classes d&eacute;finissant des blocs flottant, d'autres devront
			&ecirc;tre positionn&eacute;s de mani&egrave;re absolue pour
			respecter ce qui est demand&eacute;. A vous de trouver ...</p>
		<p>C'est dans cette phase que vous aurez &agrave; utiliser le
			deuxi&egrave;me tag div permis.</p>
		<p>La r&eacute;gle KISS est encore plus importante ici que dans
			les autres phases.</p>
		<h4>Etape 5</h4>
		<p>
			<a target="pres5" href="images/page_moyens.jpg"><img
				src="images/page_moyens_mini.jpg" alt="" width="250" height="606"
				border="1" class="flotteGauche"></a><strong>R&eacute;aliser
				la page <a href="images/page_moyens.jpg" target="pres5"><code>moyens.html</code></a>.
			</strong>
		</p>
		<p>
			Cette page est tr&egrave;s facile &agrave; r&eacute;aliser. Comme il
			y a tr&egrave;s peu de texte et que vous avez maintenant de
			l'entra&icirc;nement, vous pouvez &eacute;crire tout le code HTML en
			une seule fois, dans faire de s&eacute;paration phase texte / phase
			image. Les images doivent &ecirc;tre tagg&eacute;es correctement car
			les liens de la page
			<code>
				<a href="images/page_presentation_4.jpg" target="pres4">presentation.html</a>
			</code>
			arrive directement au bon endroit dans la page et pas
			syst&egrave;matiquement en haut de page.
		</p>
		<p>Avant de vous occupez des styles, vous devez avoir une
			structure HTML simple (KISS) et solide.</p>
		<p>Cette page utilise elle aussi uniquement 2 tags div : un pour
			le bandeau et un pour le contenu.</p>
		<p>Le bandeau est particulier car il reste toujours plac&eacute;
			en haut de la page et ne disparait pas quand on scrolle. Le fond du
			bandeau est fait avec une propri&eacute;t&eacute; CSS
			d'opacit&eacute;.</p>

		<h3>R&eacute;pertoires</h3>

		<p>
			Vous <strong><span class="texteImportant">devez</span></strong>
			utiliser l'arborescence de r&eacute;pertoires suivante :
		</p>
		<pre>cuiteur
   |___ html
   |___ images
   |      |___ photos
   |___ styles
   |___ php
   |___ upload
</pre>
		<p>
			Cette arborescence sera r&eacute;utilis&eacute;e tout au long du
			d&eacute;veloppement de l'application. Les noms <span
				class="texteImportant">doivent</span> &ecirc;tre respect&eacute;s et
			&eacute;crit en minuscules.
		</p>
		<p>
			Les pages <a href="images/page_presentation_1.jpg" target="pres1"><code>presentation_1.html</code></a>,
			<a href="images/page_presentation_2.jpg" target="pres2"><code>
					presentation_2.html</code></a>, <a href="images/page_presentation_3.jpg"
				target="pres3"><code>presentation_3.html</code></a>,
			<code>
				<a href="images/page_presentation_4.jpg" target="pres4">presentation.html</a>
			</code>
			et <a href="images/page_moyens.jpg" target="pres5"><code>moyens.html</code></a>
			seront plac&eacute;es dans le r&eacute;pertoire
			<code>html</code>
			.
		</p>
		<p>
			Les images et photos seront plac&eacute;es dans les
			r&eacute;pertoires
			<code>images</code>
			et
			<code>images/photos</code>
			. Les images que vous devez utiliser sont &agrave; <a
				href="images.zip">t&eacute;l&eacute;charger ici</a>.
		</p>
		<p>
			Les feuilles de styles seront plac&eacute;es dans le
			r&eacute;pertoire
			<code>styles</code>
			.
		</p>
		<p>
			Les r&eacute;pertoires
			<code>php</code>
			et
			<code>upload</code>
			seront utilis&eacute;s plus tard.
		</p>

		<h3>Mise en forme / mise en page</h3>
		<p>
			Les <strong>polices</strong> &agrave; utiliser sont par ordre de
			pr&eacute;f&eacute;rence Verdana, Geneva, Sans-Serif. La taille par
			d&eacute;faut est de 16 pixels avec une interligne de 1.6.
		</p>
		<p>
			Les <strong>titres</strong> ont les tailles et marges suivantes :
		</p>
		<table border="1" class="tableBord">
			<tr>
				<td align="center">Taille</td>
				<td align="center">20 pixels</td>
				<td align="center">26 pixels</td>
				<td align="center">36 pixels</td>
			</tr>
			<tr>
				<td align="center">Gras</td>
				<td align="center">oui</td>
				<td align="center">oui</td>
				<td align="center">oui</td>
			</tr>
			<tr>
				<td align="center">Marges</td>
				<td align="center">18 pixels</td>
				<td align="center">22 pixels</td>
				<td align="center">26 pixels</td>
			</tr>
		</table>
		<p>Le plus gros titre est soulign&eacute; par un trait de 3 pixels
			d'&eacute;paisseur.</p>
		<table border="1" class="tableBord">
			<tr>
				<td align="center">couleur de fond</td>
				<td align="center">couleur des textes</td>
				<td align="center">couleur des liens</td>
				<td align="center">couleur texte en bas</td>
			</tr>
			<tr>
				<td align="center">#20190F</td>
				<td align="center">#E8DBB1</td>
				<td align="center">#3C96F1</td>
				<td align="center">#EF9C3B</td>
			</tr>
		</table>
		<p>
			Les <strong>liens</strong> sont en gras et se soulignent quand ils
			sont survol&eacute;s par la souris.
		</p>
		<p>
			Les <strong>liens &quot;Cuiteur&quot;</strong> pointent tous sur la
			page
			<code>inscription.php</code>
			qui se trouve dans le r&eacute;pertoire php. Cette page sera
			r&eacute;alis&eacute;e plus tard.
		</p>
		<p>
			Le<strong> lien &quot;microblogage&quot; </strong>pointe sur la page
			Microblog de wikipedia. Cette page doit s'ouvrir dans une nouvelle
			fen&ecirc;tre (ou onglet).
		</p>
		<p>
			Les <strong>6 liens des photos</strong> dans la partie &quot;Les
			moyens techniques de Cuiteur&quot; pointent sur les photos
			correspondantes en grande taille dans la page <a
				href="images/page_moyens.jpg" target="pres5"><code>moyens.html</code></a>.
			Quand on clique sur un de ces liens on doit arriver directement sur
			la photo correspondante.
		</p>
		<p>
			La <strong>mise en page</strong> est tr&egrave;s simple. Le contenu
			est mis dans un bloc de 800 pixels de large, centr&eacute; dans la
			fen&ecirc;tre du navigateur.
		</p>
		<p>Les images sur les bords gauche et droit sont &agrave; cheval
			sur le bloc de contenu et d&eacute;passe &agrave; gauche ou &agrave;
			droite de 60 pixels.</p>
		<p>Les textes doivent &ecirc;tre plac&eacute; &agrave; 32 pixels
			des bords grauche et droit du bloc contenu.</p>
		<p>
			<img src="images/dimensions.jpg" width="900" height="768">
		</p>
	</div>

</body>
</html>